ch4ron/Rocket-Software/Staszek/Staszek.ioc
RCC.IPParameters=AHBFreq_Value,APB1CLKDivider,APB1Freq_Value,APB1TimFreq_Value,APB2CLKDivider,APB2Freq_Value,APB2TimFreq_Value,CECFreq_Value,CortexFreq_Value,FCLKCortexFreq_Value,FMPI2C1Freq_Value,FamilyName,HCLKFreq_Value,MCO2PinFreq_Value,PLLCLKFreq_Value,PLLI2SPCLKFreq_Value,PLLI2SQCLKFreq_Value,PLLI2SRCLKFreq_Value,PLLM,PLLN,PLLQCLKFreq_Value,PLLRCLKFreq_Value,PLLSAIPCLKFreq_Value,PLLSAIQCLKFreq_Value,PWRFreq_Value,SAIAFreq_Value,SAIBFreq_Value,SDIOFreq_Value,SPDIFRXFreq_Value,SYSCLKFreq_VALUE,SYSCLKSource,USBFreq_Value,VCOI2SInputFreq_Value,VCOI2SOutputFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value,VCOSAIInputFreq_Value,VCOSAIOutputFreq_Value
PE11.Locked=true
ProjectManager.AskForMigrate=true
Mcu.Name=STM32F446V(C-E)Tx
PE0.Signal=GPIO_Output
PE7.GPIO_Label=SERVO_RX
PE12.Signal=SPI4_SCK
PA2.Signal=GPIO_Output
Mcu.IP8=SPI2
Mcu.IP9=SPI4
PD14.Signal=GPIO_Output
Mcu.IP6=RCC
RCC.VCOSAIInputFreq_Value=1000000
Mcu.IP7=SPI1
ProjectManager.CoupleFile=true
PB3.Signal=SPI1_SCK
RCC.SYSCLKFreq_VALUE=180000000
PE7.Mode=Asynchronous
PA1.Locked=true
PA7.GPIO_Label=ADC_CURRENT1
PA12.Mode=Master
KeepUserPlacement=false
PC5.GPIO_Label=ADC_CURRENT3
Dma.SPI4_RX.0.Direction=DMA_PERIPH_TO_MEMORY
Dma.SPI1_RX.5.MemInc=DMA_MINC_ENABLE
Dma.SPI4_RX.0.Instance=DMA2_Stream3
PB7.Mode=I2C
PA14.Signal=SYS_JTCK-SWCLK
Dma.SPI1_TX.4.Mode=DMA_NORMAL
PC6.GPIOParameters=GPIO_Label
SH.S_TIM1_CH3.0=TIM1_CH3,PWM Generation3 CH3
SH.S_TIM3_CH4.ConfNb=1
ADC1.NbrOfConversionFlag=1
RCC.PLLM=8
Dma.SPI1_RX.5.Mode=DMA_NORMAL
RCC.PLLN=180
PB8.Signal=S_TIM4_CH3
PE3.GPIO_Label=MPU_INT
Dma.SPI1_RX.5.Direction=DMA_PERIPH_TO_MEMORY
PC8.Locked=true
NVIC.DMA1_Stream3_IRQn=true\:5\:0\:true\:false\:true\:false\:true
PC9.Signal=S_TIM3_CH4
PD9.Locked=true
RCC.APB1Freq_Value=45000000
ProjectManager.DeviceId=STM32F446VETx
PB12.Signal=CAN2_RX
ProjectManager.LibraryCopy=1
PE1.GPIOParameters=GPIO_Label
PA3.GPIO_Label=ISL_COMMON
SH.S_TIM3_CH4.0=TIM3_CH4
PB1.GPIOParameters=GPIO_Label
PA7.Signal=ADCx_IN7
Dma.SPI4_RX.0.FIFOMode=DMA_FIFOMODE_DISABLE
